// Задача 41: Пользователь вводит с клавиатуры M чисел. Посчитайте, сколько чисел больше 0 ввёл пользователь.
// 0, 7, 8, -2, -2 -> 2
// 1, -7, 567, 89, 223-> 3

// int[] GetArray(int size,int minValue, int maxValue)
// {
//     int[] array = new int[size];
//     for (int i = 0; i < size; i++)
//     {
//         array[i] = new Random().Next(minValue, maxValue + 1);
//     }
//     return array;
// }
// int[] resultArray = GetArray(4, -99, 100);
// Console.WriteLine(String.Join("; ", resultArray));

// int countNumber = 0; 
// for (int i = 0; i < resultArray.Length; i++)
// {
//     if (resultArray[i] > 0)
//     countNumber++;
// }
// Console.WriteLine($"Количество чисел > 0 равно {countNumber}");




// Задача 42: Напишите программу, которая найдёт точку пересечения двух прямых, 
// заданных уравнениями y = k1 * x + b1, y = k2 * x + b2; значения b1, k1, b2 и k2 задаются пользователем.
// b1 = 2, k1 = 5, b2 = 4, k2 = 9 -> (-0,5; -0,5)

Console.Write("Введите b1: ");
double b1 = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите k1: ");
double k1 = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите b2: ");
double b2 = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите k2: ");
double k2 = Convert.ToInt32(Console.ReadLine());

double y = ((k1*b2) - (b1*k2)) / (k1 - k2);
double x = (y - b2) / k2;

Console.WriteLine(String.Join("; ", x, y));